package spain.barcelona.mydraw;

public class Pic {
    private String name;
    // Ex: 74 X 12
    private String size;
    // Ex: 1 (portrait), 2 (landscape)
    private int orientation;
    // Ex: Холст масло
    private String detail;
    // Ex: 1975
    private int category;
    // Ex: 1 - painting; 2-graphic
    private String year;
    // Ex: 1 (1970-1979), 2(1980-1989), 3(1990-1909), 4(2000-2012), 5 (1970-2012)
    private int period;
    private int imageResourceId;

    public static final Pic[] paint = {
            new Pic("Осень", "80х50", 1, "Холст, масло", 1, "1974", 1, R.drawable.p01_1974),
            new Pic("Пейзаж с тереконом", "41.5х44", 2, "Холст на оргалите, масло", 1, "1974", 1, R.drawable.p02__1974),
            new Pic("Пейзаж с деревом", "49.5х39.5", 1, "Холст, масло", 1, "1974", 1, R.drawable.p03_1974),
            new Pic("Вибрации света и тени", "42х29.5", 1, "Картон, масло", 1, "1974", 1, R.drawable.p04_1974),
            new Pic("Паганини", "", 1, "", 1, "1974", 1, R.drawable.p05_1974),
            new Pic("Коломбина", "88.5х58", 1, "Картон, масло", 1, "1975", 1, R.drawable.p06_1975),
            new Pic("Нико Пиросмани", "81х59.5", 1, "Холст, масло", 1, "1975", 1, R.drawable.p07_1975),
            new Pic("Степь / Травы", "61х80", 2, "Холст, масло", 1, "1975", 1, R.drawable.p08_1975),
            new Pic("Пейзаж с розовыми облаками (эскиз)", "30.5х34", 2, "Картон, масло", 1, "1976", 1, R.drawable.p09_1976),
            new Pic("Пилигрим 1", "", 1, "", 1, "1976", 1, R.drawable.p10_1976),
            new Pic("Автопортрет с трубкой", "70х60", 1, "Холст, масло", 1, "1976", 1, R.drawable.p11_1976),
            new Pic("Обнаженная (И.В.)", "63.5х51", 1, "Холст на картоне, масло", 1, "1976", 1, R.drawable.p12_1976),
            new Pic("Раздвоенность во время ожидания", "", 1, "", 1, "1976", 1, R.drawable.p13_1976),
            new Pic("Натюрморт с подсолнухом и кабачками", "58х42", 1, "Холст на картоне, масло", 1, "1976", 1, R.drawable.p14_1976),
            new Pic("Натюрморт с цветущим абрикосом и луком", "69х46.5", 1, "Холст на картоне, масло", 1, "1977", 1, R.drawable.p15_1977),
            new Pic("Натюрморт со столетником", "75х69.5", 1, "Холст, масло", 1, "1977", 1, R.drawable.p16_1977),
            new Pic("Натюрморт с колбой", "65.5х50", 1, "Холст на картоне, масло", 1, "1977", 1, R.drawable.p17__1977),
            new Pic("Портрет отца художника", "85.5х80.5", 1, "Холст, масло", 1, "1977", 1, R.drawable.p18_1977),
            new Pic("Автопортрет", "79х60", 1, "Холст, масло", 1, "", 1, R.drawable.p19),
            new Pic("Автопортрет в красной шапке", "", 1, "Холст, масло", 1, "1978", 1, R.drawable.p20_1978),
            new Pic("Портрет Владимира Баскаева", "69х57.5", 1, "Холст, масло", 1, "1978", 1, R.drawable.p21_1978),
            new Pic("Портрет Аркадия Ситника с гитарой", "90х59.5", 1, "Холст, масло", 1, "1978", 1, R.drawable.p22_1978),
            new Pic("Портрет Михаила Гапонова", "", 1, "", 1, "1978", 1, R.drawable.p23_1978),
            new Pic("Пейзаж", "57х60", 2, "Картон, масло", 1, "1978", 1, R.drawable.p24_1978),
            new Pic("Портрет Ольги", "60х79.5", 2, "Холст, масло", 1, "1979", 1, R.drawable.p25_1979),
            new Pic("Пейзаж с домиком у террикона", "48х68.5", 2, "Холст на оргалите, масло", 1, "1979", 1, R.drawable.p26_1979),
            new Pic("Натюрморт с арбузом", "44.5х61", 2, "Холст на оргалите, масло", 1, "1979", 1, R.drawable.p27_1979),
            new Pic("Тропинка в лесу", "60х45", 1, "Картон, масло", 1, "1979", 1, R.drawable.p28_1979),
            new Pic("Освобождение", "79.2х46", 1, "Картон, масло", 1, "", 1, R.drawable.p29),
            new Pic("Пейзаж с лодкой", "40х40", 1, "Картон, масло", 1, "", 1, R.drawable.p30),
            new Pic("Натюрморт", "53х37", 1, "Холст, масло", 1, "", 1, R.drawable.p31),
            new Pic("Пейзаж с сухими деревьями", "40.5х51.5", 2, "Холст, масло", 1, "", 1, R.drawable.p32),

            new Pic("Голгофа", "26х38.5", 2, "Холст на дереве, масло", 1, "1981", 2, R.drawable.p33_1981),
            new Pic("Портрет Аркадия Ситника", "50х37", 1, "Холст, масло", 1, "1981", 2, R.drawable.p34_1981),
            new Pic("Портрет Александра Бондаренко", "46х44", 1, "Холст, масло", 1, "1983", 2, R.drawable.p35_1983),
            new Pic("Автопортрет", "35х24.5", 1, "Картон, масло", 1, "1983", 2, R.drawable.p36_1983),
            new Pic("Портрет Л.И. Пищальниковой", "78х80", 2, "Холст, масло", 1, "1984", 2, R.drawable.p37_1984),
            new Pic("Ностальгия", "73.5х53.5", 1, "Холст, масло", 1, "1984", 2, R.drawable.p38_1984),
            new Pic("Белые ночи на Невском проспекте", "78х80", 2, "Холст, масло", 1, "1984", 2, R.drawable.p39_1984),
            new Pic("Красный дом", "60х80", 2, "Холст, масло", 1, "1985", 2, R.drawable.p40_1985),
            new Pic("Заброщенный объект", "40х64", 2, "Холст, масло", 1, "1985", 2, R.drawable.p41_1985),
            new Pic("Портрет Л.И. Пищальниковой", "50.5х36.5", 1, "Холст, масло", 1, "1986", 2, R.drawable.p42_1986),
            new Pic("Разрушение образа", "", 2, "Оргалит, коллаж", 1, "1987", 2, R.drawable.p43_1987),
            new Pic("Амбразура / Убежище", "65х95.5", 2, "Холст, масло", 1, "1987", 2, R.drawable.p44_1987),
            new Pic("Пейзаж", "69х135", 2, "Холст, масло", 1, "1988", 2, R.drawable.p45_1988),
            new Pic("Годо пришёл", "", 1, "Холст на фанере, тушь, акварель, темпера, ПВА", 1, "1989", 2, R.drawable.p46_1989),
            new Pic("Уничтоженная земля", "75х85.7", 2, "ДСП, масло, коллаж", 1, "1989", 2, R.drawable.p47_1989),

            new Pic("Крепость в Северной Англии", "35х48", 2, "Картон, масло", 1, "1990", 3, R.drawable.p48_1990),
            new Pic("Середина суток", "20.7х23.2", 2, "Холст на фанере, масло", 1, "1990", 3, R.drawable.p49_1990),
            new Pic("Там тебя ждут", "50х70", 2, "Оргалит, масло", 1, "1990", 3, R.drawable.p50_1990),
            new Pic("Женщина с бабочкой", "50х37", 1, "Холст, масло", 1, "1991", 3, R.drawable.p51_1991),
            new Pic("Помяни прошлое и детей своих", "85.5х110", 2, "", 1, "1991", 3, R.drawable.p52_1991),
            new Pic("Драма в облаках 1", "95.5х80.5", 1, "", 1, "1992", 3, R.drawable.p53_1992),
            new Pic("Жёлотое облако, чёрное озеро", "122х70.5", 1, "Холст, масло", 1, "1992", 3, R.drawable.p54_1992),
            new Pic("Всё пройдет незаметно", "", 2, "Холст, масло", 1, "1992", 3, R.drawable.p55_1992),
            new Pic("Он приближается 2", "80.7х114.5", 2, "Холст, масло", 1, "1992", 3, R.drawable.p56_1992),
            new Pic("Жизнь человека 2", "78х97", 2, "Холст, масло", 1, "1992", 3, R.drawable.p57_1992),
            new Pic("Гость из прошлого", "68х78.5", 2, "Холст, масло", 1, "1992", 3, R.drawable.p58_1992),
            new Pic("Сублимация (Пигмалион и Галатея)", "100х120", 2, "Холст, масло", 1, "1992", 3, R.drawable.p59_1992),
            new Pic("Медленно вверх - импровизация", "69х49.5", 1, "Картон, масло", 1, "1993", 3, R.drawable.p60_1993),
            new Pic("Чарли-птица", "37.5х50", 2, "Оргалит, масло", 1, "1993", 3, R.drawable.p61_1993),
            new Pic("Праздник на Монмартре", "31х42.5", 2, "Холст на картоне, масло", 1, "1993", 3, R.drawable.p62_1993),
            new Pic("Попытка к бегству - клаустрофобия", "60х70", 2, "Оргалит, масло", 1, "1993", 3, R.drawable.p63_1993),
            new Pic("Пораженное место", "102.5х80", 1, "Холст, масло", 1, "1993", 3, R.drawable.p64_1993),
            new Pic("С точки зрения Вечности", "90.5х98.5", 2, "Холст, масло", 1, "1993", 3, R.drawable.p65_1993),
            new Pic("Мой дом - моё тело - мой разум", "82.5х91", 2, "Холст, масло", 1, "1993", 3, R.drawable.p66_1993),
            new Pic("Эгмонт", "62х54.5", 1, "Холст, масло", 1, "1993", 3, R.drawable.p67_1993),
            new Pic("Угасание - Долина духов", "52х64", 2, "Холст, масло", 1, "1993", 3, R.drawable.p68_1993),
            new Pic("Ты не заблудишься", "63х72.5", 2, "Холст, масло", 1, "1993", 3, R.drawable.p69_1993),
            new Pic("След Бога", "53х74", 2, "Холст, масло", 1, "1994", 3, R.drawable.p70_1994),
            new Pic("Твоё последнее место", "39.5х55", 2, "Холст, масло", 1, "1994", 3, R.drawable.p71_1994),
            new Pic("Потала", "76х84", 2, "Холст, масло", 1, "1994", 3, R.drawable.p72_1994),
            new Pic("Дерево в бурю", "45.5х57.3", 2, "Холст, масло", 1, "1995", 3, R.drawable.p73_1995),
            new Pic("Твой прощальный подарок", "81.0х69.5", 1, "Холст, масло", 1, "1995", 3, R.drawable.p74_1995),
            new Pic("Anatome melos chole", "106.4х114.5", 2, "Холст, масло", 1, "1995", 3, R.drawable.p75_1995),
            new Pic("Пейзаж", "38.5х50", 2, "Оргалит, масло", 1, "1997", 3, R.drawable.p76_1997),
            new Pic("Пагода облаков", "35.5х50.5", 2, "Холст, масло", 1, "1997", 3, R.drawable.p77_1997),
            new Pic("Ван Гог, мимесис", "", 1, "", 1, "1997", 3, R.drawable.p78_1997),
            new Pic("Стог сена. Эскиз №3", "43х59", 2, "Холст, масло", 1, "1998", 3, R.drawable.p79_1998),
            new Pic("Пилигрим", "109.5х118.5", 2, "Холст, масло", 1, "1998", 3, R.drawable.p80_1998),
            new Pic("Taurmatura", "140.5х110.5", 1, "Холст, масло", 1, "1999", 3, R.drawable.p81_1999),

            new Pic("Лошади в развалинах храма", "70х91", 2, "Холст, масло", 1, "2000", 4, R.drawable.p82_2000),
            new Pic("Осенний натюрморт", "60х45.7", 1, "Холст, масло", 1, "2000", 4, R.drawable.p83_2000),
            new Pic("Натюрморт с яблоками и цветами", "69х69", 1, "Холст, масло", 1, "2001", 4, R.drawable.p84_2001),
            new Pic("Натюрморт с черепом", "", 1, "Холст, масло", 1, "2001", 4, R.drawable.p85_2001),
            new Pic("Полет Аристея", "", 2, "", 1, "2001", 4, R.drawable.p86_2001),
            new Pic("Сны и мечты эмиды Елизаветы", "", 2, "Холст, масло", 1, "2001", 4, R.drawable.p87_2001),
            new Pic("Усталые города", "", 1, "Холст, масло", 1, "2002", 4, R.drawable.p88_2002),
            new Pic("Чертополох", "77.5х71", 1, "Холст, масло", 1, "2002", 4, R.drawable.p89_2002),
            new Pic("Коан капель дождя", "160х119.5", 1, "Холст, масло", 1, "2002", 4, R.drawable.p90_2002),
            new Pic("Астры и космеи", "55.5х51.5", 1, "Холст, масло", 1, "2005", 4, R.drawable.p91_2005),
            new Pic("Натюрморт с калиной", "", 1, "", 1, "2005", 4, R.drawable.p92_2005),
            new Pic("Пейзаж", "20.0х27.5", 2, "Картон, масло", 1, "2006", 4, R.drawable.p93_2006),
            new Pic("Сирень", "67х55", 1, "Оргалит, масло", 1, "2007", 4, R.drawable.p94_2007),
            new Pic("Знаки на Солнце", "120х120", 1, "Холст, масло", 1, "2007", 4, R.drawable.p95_2007),
            new Pic("Тропический полдень", "87х68", 1, "Холст, масло", 1, "2008", 4, R.drawable.p96_2008),
            new Pic("Натюрморт с веткой абрикосы", "67.5х55.5", 1, "Фанера, масло", 1, "2008", 4, R.drawable.p97_2008),
            new Pic("Натюрморт", "59.5х44.5", 1, "Оргалит, масло", 1, "2008", 4, R.drawable.p98_2008),
            new Pic("Пилигрим - детство, радуга", "68.5х85", 2, "Оргалит, масло", 1, "2008", 4, R.drawable.p99_2008),
            new Pic("Стога", "", 2, "Оргалит, масло", 1, "2010", 4, R.drawable.p100_2010),
            new Pic("Сумерки", "", 2, "Холст, масло", 1, "2010", 4, R.drawable.p101_2010),
            new Pic("Скала высохших слез", "30х11", 1, "Холст на дереве, масло", 1, "2010", 4, R.drawable.p102_2010),
            new Pic("Хмурый день - сухой куст", "18.6х26.7", 2, "Холст на фанере, масло", 1, "2010", 4, R.drawable.p103_2010),
            new Pic("Степная речка", "71х90.5", 2, "Холст, масло", 1, "2011", 4, R.drawable.p104_2011),
            new Pic("Портрет Георгия Беляева", "57х29.5", 1, "Оргалит, масло", 1, "2011", 4, R.drawable.p105_2011),
            new Pic("Гибель богов", "77.5х60", 1, "Холст, масло, смола", 1, "2011", 4, R.drawable.p106_2011),
            new Pic("Древо сомнений", "52.5х62.5", 2, "Картон, масло", 1, "2011", 4, R.drawable.p107_2011)
    };

    public static final Pic[] pics = {
            new Pic("Скрипка Поганини", "", 1, "Бумага, тушь, перо", 2, "1974", 1, R.drawable.g01_1974),
            new Pic("Пробуждение", "27.9х19.6", 1, "Бумага, тушь, перо, кисть", 2, "1975", 1, R.drawable.g02_1975),
            new Pic("\"Вересковый мёд\"", "20.5х14.7", 1, "Бумага, тушь, перо, карандаш", 2, "1975", 1, R.drawable.g03_1975),
            new Pic("Волкодлак", "25.3х18.5", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g04),
            new Pic("Сидящая", "23.3х13.9", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g05),
            new Pic("Сидящая обнаженная", "29.9х21", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g06),
            new Pic("Сидящая обнаженная со спины", "23.4х19.2", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g07),
            new Pic("Художник и его модель 1", "29.8х21", 1, "Бумага, тушь, перо, карандаш, бистр", 2, "1976", 1, R.drawable.g08_1976),
            new Pic("Художник и его модель 2", "29.8х21", 1, "Бумага, тушь, бистр", 2, "1976", 1, R.drawable.g09_1976),
            new Pic("Художник и его модель", "23.3х21.1", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g10),
            new Pic("Ночь", "58х67", 2, "Бумага, акварель", 2, "1976", 1, R.drawable.g11_1976),
            new Pic("Нордический тип", "21х26.7", 2, "Бумага, тушь", 2, "", 1, R.drawable.g12),
            new Pic("Травля", "27.6х19.3", 1, "Бумага, тушь, карандаш", 2, "", 1, R.drawable.g13),
            new Pic("Травля: Печальное солнце", "29.7х21.1", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g14),
            new Pic("Мечтатель", "29.9х21.1", 1, "Бумага, тушь, тростниковое перо", 2, "", 1, R.drawable.g15),
            new Pic("Памяти Чюрлёниса", "31.5х44", 2, "Бумага, акварель", 2, "1977", 1, R.drawable.g16_1977),
            new Pic("Двое", "39.5х63.5", 2, "Бумага, темпера", 2, "1977", 1, R.drawable.g17_1977),
            new Pic("Автопортрет", "29.4х19.2", 1, "Бумага, тушь, перо", 2, "1977", 1, R.drawable.g18_1977),
            new Pic("Портрет девочки", "26х18.5", 1, "Бумага, тушь, перо, цветные карандаши", 2, "", 1, R.drawable.g19),
            new Pic("Мэтр Вийон в Париже 1", "29.9х21.1", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g20),
            new Pic("Мэтр Вийон в Париже 2", "29.9х21", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g21),
            new Pic("Одиссей и Циклоп", "29.6х21.1", 1, "Бумага, тушь, перо, карандаш", 2, "", 1, R.drawable.g22),
            new Pic("Коломбина", "21х15", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g23),
            new Pic("Лесоруб", "29.7х21", 1, "Бумага, тушь, перо, карандаш", 2, "", 1, R.drawable.g24),
            new Pic("Христос в пустыне", "20.5х17", 1, "Бумага, тушь, бистр, перо, кисть", 2, "", 1, R.drawable.g25),
            new Pic("Винсент Ван Гог", "", 1, "Бумага, тушь, перо", 2, "", 1, R.drawable.g26),
            new Pic("Ван Гог", "14.5х20", 2, "Бумага, тушь, тростниковой перо", 2, "", 1, R.drawable.g27),
            new Pic("Портрет отца художника", "27х19.5", 1, "Бумага, графит", 2, "1977", 1, R.drawable.g28_1977),
            new Pic("Портрет Михаила Гапонова", "21х29.7", 2, "Бумага, тушь, тростниковое перо", 2, "1977", 1, R.drawable.g29_1977),
            new Pic("Портрет Михаила Гапонова", "21х14", 1, "Бумага, карандаш", 2, "", 1, R.drawable.g30),
            new Pic("Портрет Н. Золотарёвой", "29.8х21", 1, "Бумага, уголь", 2, "1979", 1, R.drawable.g31_1979),
            new Pic("Пейзаж с домиком у террикона", "", 2, "Бумага тонированная, тушь", 2, "1979", 1, R.drawable.g32_1979),
            new Pic("В мастерской", "21.1х29.7", 2, "Бумага, тушь, перо, кисть", 2, "", 1, R.drawable.g33),
            new Pic("Поворот дороги", "14х12.5", 1, "Бумага, акварель, тушь", 2, "", 1, R.drawable.g34),
            new Pic("Красный Луч. На окраине города", "28х20", 1, "Бумага, фломастер", 2, "", 1, R.drawable.g35),

            new Pic("Киноцефал и нимфа", "20.2х29.2", 2, "Бумага тушь, перо, кисть", 2, "1980", 2, R.drawable.g36_1980),
            new Pic("Странный депрессивный автопортрет", "20х13.9", 1, "Бумага, тушь, тростниковое перо", 2, "1981", 2, R.drawable.g37_1981),
            new Pic("Отдых на пути в Египет", "16х25.7", 2, "Бумага, тушь, тростниковое перо, кисть", 2, "1981", 2, R.drawable.g38_1981),
            new Pic("Достоевский 1", "15х10", 1, "Бумага, карандаш", 2, "1981", 2, R.drawable.g39_1981),
            new Pic("Достоевский 2", "15х10", 1, "Бумага, карандаш", 2, "1981", 2, R.drawable.g40_1981),
            new Pic("Достоевский 3", "15х10", 1, "Бумага, карандаш", 2, "1981", 2, R.drawable.g41_1981),
            new Pic("Лев Толстой", "15х10", 1, "Бумага, карандаш", 2, "", 2, R.drawable.g42),
            new Pic("Ибсен", "16.7х15", 2, "Бумага, карандаш", 2, "", 2, R.drawable.g43),
            new Pic("Танец жизни", "19.7х28.5", 2, "Бумага, тушь", 2, "1982", 2, R.drawable.g44_1982),
            new Pic("Паучок", "25.9х17.2", 1, "Бумага серая, тушь, кисть", 2, "1986", 2, R.drawable.g45_1986),
            new Pic("Одинокий ворон", "28.5х19.4", 1, "Бумага, тушь", 2, "1986", 2, R.drawable.g46_1986),
            new Pic("Бодхидхарма у скалы", "23.8х13.8", 1, "Бумага, тушь, бистр", 2, "1986", 2, R.drawable.g47_1986),
            new Pic("Порыв ветра", "21х19.4", 1, "Бумага, тушь", 2, "1986", 2, R.drawable.g48_1986),
            new Pic("Лао-цзы", "10.8х23.1", 2, "Бумага, акварель, тушь", 2, "", 2, R.drawable.g49),
            new Pic("Осеннее дерево", "", 2, "Бумага, акварель", 2, "1988", 2, R.drawable.g50_1988),
            new Pic("Церковь в Хрусталке", "24.5х37", 2, "Бумага, акварель", 2, "", 2, R.drawable.g51),
            new Pic("Террикон", "20.3х27", 2, "Бумага, акварель, белила, карандаш", 2, "", 2, R.drawable.g52),
            new Pic("Мусульманское кладбище", "21х29.5", 2, "Бумага, акварель", 2, "", 2, R.drawable.g53),
            new Pic("Самарканд, Регистан", "21х29.6", 2, "Бумага, карандаш", 2, "", 2, R.drawable.g54),
            new Pic("Пивная", "21х15", 1, "Бумага, карандаш", 2, "", 2, R.drawable.g55),
            new Pic("Дерево-образ", "28х20", 1, "Бумага, карандаш", 2, "", 2, R.drawable.g56),
            new Pic("По Борхесу", "16х18.1", 2, "Бумага, тушь, перо, кисть", 2, "", 2, R.drawable.g57),
            new Pic("Угол мастерской", "20.7х30", 2, "Бумага, тушь, перо, кисть, карандаш", 2, "", 2, R.drawable.g58),
            new Pic("Композиция", "16х19.9", 2, "Бумага, тушь", 2, "", 2, R.drawable.g59),
            new Pic("Композиция", "45х34.5", 1, "Бумага, акварель, гуашь, карандаш", 2, "", 2, R.drawable.g60),

            new Pic("", "30.5х21.6", 1, "Бумага, акварель", 2, "1991", 3, R.drawable.g61_1991),
            new Pic("", "29.7х21", 1, "Бумага, акварель", 2, "1991", 3, R.drawable.g62_1991),
            new Pic("", "29.6х21", 1, "Бумага, акварель", 2, "1991", 3, R.drawable.g63_1991),
            new Pic("", "44х31", 1, "Бумага, акварель, тушь", 2, "1991", 3, R.drawable.g64_1991),
            new Pic("", "76х58", 1, "Бумага, акварель, темпера", 2, "1991", 3, R.drawable.g65_1991),
            new Pic("", "59х40.5", 1, "Бумага, гуашь, тушь, ПВА", 2, "1991", 3, R.drawable.g66_1991),
            new Pic("", "54х40", 1, "Бумага, гуашь, тушь", 2, "1992", 3, R.drawable.g67_1992),
            new Pic("", "26х38.5", 2, "Бумага, тушь, перо, кисть", 2, "1993", 3, R.drawable.g68_1993),
            new Pic("", "22х15.4", 1, "Бумаг, акварель, тушь, перо, кисть", 2, "1993", 3, R.drawable.g69_1993),
            new Pic("", "21.7х29.8", 2, "Бумага, тушь, белила, коллаж", 2, "1994", 3, R.drawable.g70_1994),
            new Pic("", "40х27", 1, "Бумага на картоне, тушь, акварель, гуашь", 2, "1994", 3, R.drawable.g71_1994),
            new Pic("", "12.1х18", 2, "Бумага, карандаш, тушь, перо", 2, "1994", 3, R.drawable.g72_1994),
            new Pic("", "29.9х21", 1, "Бумага, тушь, перо, бистр", 2, "1995", 3, R.drawable.g73_1995),
            new Pic("", "37.6х27.8", 1, "Бумага, уголь, сангина", 2, "1995", 3, R.drawable.g74_1995),
            new Pic("", "16.1х20.4", 2, "Бумага, уголь, сепия, гуашь, ПВА", 2, "1995", 3, R.drawable.g75_1995),
            new Pic("", "19.5х19.5", 1, "Картон, гуашь, тушь", 2, "1996", 3, R.drawable.g76_1996),
            new Pic("", "30х42", 2, "Бумага, акварель", 2, "1999", 3, R.drawable.g77_1999),
            new Pic("", "11.8х14.2", 2, "Бумага, тушь, кисть", 2, "", 3, R.drawable.g78),
            new Pic("", "39х29.5", 2, "Бумага тонированная, графит", 2, "1999", 3, R.drawable.g79_1999),

            new Pic("Отдых", "21х14.9", 1, "Бумага, тушь, чернила", 2, "2000", 4, R.drawable.g80_2000),
            new Pic("Натюрморт с тыквой и подсвечником", "51х36.5", 1, "Бумага, акварель", 2, "2002", 4, R.drawable.g81_2002),
            new Pic("Человек с собакой", "21х16", 1, "Бумага, тушь, перо, чернила, карандаш", 2, "2002", 4, R.drawable.g82_2002),
            new Pic("Убитая степь", "", 2, "Бумага, акварель, белила", 2, "2002", 4, R.drawable.g83_2002),
            new Pic("Сафо", "16.3х13.6", 1, "Бумага, тушь, чернила", 2, "2005", 4, R.drawable.g84_2005),
            new Pic("Охотники на снегу", "20.7х29.3", 2, "Бумага, тушь, бистр, карандаш", 2, "2010", 4, R.drawable.g85_2010)
    };

    private Pic(String name, String size, int orientation, String
            detail, int category, String year, int period, int imageResourceId) {
        this.name = name;
        this.size = size;
        this.orientation = orientation;
        this.detail = detail;
        this.category = category;
        this.year = year;
        this.period = period;
        this.imageResourceId = imageResourceId;
    }

    public String getName() {
        return name;
    }

    public String getSize() {
        return size;
    }

    public int getOrientation() {
        return orientation;
    }

    public String getDetail() {
        return detail;
    }

    public int getCategory() {
        return category;
    }

    public String getYear() {
        return year;
    }

    public int getPeriod() {
        return period;
    }

    public int getImageResourceId() {
        return imageResourceId;
    }
}

